# AngularDimension Class

---
C#Visual BasicVisual C++
Revit 2024 API
---
AngularDimension Class
Members See Also
---
An object that represents an Angular Dimension within the Revit project.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2017
# Syntax
C#
---
```text
public class AngularDimension : Dimension
```

Visual Basic
---
```text
Public Class AngularDimension _
	Inherits Dimension
```

Visual C++
---
```text
public ref class AngularDimension : public Dimension
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB..::..Element Autodesk.Revit.DB..::..Dimension Autodesk.Revit.DB..::..AngularDimension
# See Also
AngularDimension Members
Autodesk.Revit.DB Namespace